Catalogs/РегистрационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>РегистрационныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУточняемый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееПоздравление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РегистрационныеКарты/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаОбъекта") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаЭлементаРегистрационнаяКарта"; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПолученияФормы()

Функция НайтиПоКодуКарты(КодКарты) Экспорт
	
	// Поиск.
	Возврат Справочники.РегистрационныеКарты.НайтиПоРеквизиту("КодКарты", КодКарты);

КонецФункции // НайтиПоКодуКарты()

Функция ДобавитьРегистрационнуюКарту(КодКарты, ВидКарты = Неопределено, ВладелецКарты, ГруппаПользователей) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	РегистрационнаяКартаСсылка = НайтиПоКодуКарты(КодКарты);
	Если ЗначениеЗаполнено(РегистрационнаяКартаСсылка) Тогда
		РегистрационнаяКартаОбъект = РегистрационнаяКартаСсылка.ПолучитьОбъект();
	Иначе
		РегистрационнаяКартаОбъект = Справочники.РегистрационныеКарты.СоздатьЭлемент();
	КонецЕсли;
	РегистрационнаяКартаОбъект.КодКарты = КодКарты;
	РегистрационнаяКартаОбъект.ВидКарты = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ВидКарты, Перечисления.ВидыИнформационныхКарт.Магнитная);
	РегистрационнаяКартаОбъект.ВладелецКарты = ВладелецКарты.Ссылка;
	РегистрационнаяКартаОбъект.ГруппаПользователей = ГруппаПользователей;
	РегистрационнаяКартаОбъект.ПометкаУдаления = Ложь;
	
	РегистрационнаяКартаОбъект.Записать();

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РегистрационнаяКартаОбъект.Ссылка;
	
КонецФункции // ДобавитьРегистрационнуюКарту()

Процедура УдалитьРегистрационнуюКарту(КодКарты, Удалить = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если (ТипЗнч(КодКарты) = Тип("СправочникСсылка.РегистрационныеКарты")) Тогда
		РегистрационнаяКартаСсылка = КодКарты;
	Иначе
		РегистрационнаяКартаСсылка = НайтиПоКодуКарты(КодКарты);
	КонецЕсли; 
	Если ЗначениеЗаполнено(РегистрационнаяКартаСсылка) Тогда
		РегистрационнаяКартаОбъект = РегистрационнаяКартаСсылка.ПолучитьОбъект();
		РегистрационнаяКартаОбъект.ВладелецКарты = Справочники.Пользователи.ПустаяСсылка();
		РегистрационнаяКартаОбъект.ГруппаПользователей = Неопределено;
		РегистрационнаяКартаОбъект.ПометкаУдаления = РегистрационнаяКартаОбъект.ПометкаУдаления Или Удалить;
		
		РегистрационнаяКартаОбъект.Записать();
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // УдалитьРегистрационнуюКарту()

Процедура СоздатьЗаписьВСправочнике(CODE, CODESTR, NAME, TIP, DISC, CHECKCARD, OLDCODE, PERCENT, SUM, ВидКарты ,СтрАнализа ) Экспорт 
	
	Если TIP = 2 Тогда
		СтрАнализа.Удаленных = СтрАнализа.Удаленных + 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("КодКарты", CODE);
	Запрос.УстановитьПараметр("Диск", DISC);	
	Запрос.УстановитьПараметр("ВладелецКарты", NAME);	
	//Запрос.УстановитьПараметр("ПроцентУточняемый", ЧИСЛО(PERCENT));
	//Костенюк Александр-Старт 02.04.2012
	Если ЗначениеЗаполнено(PERCENT) Тогда
		Запрос.УстановитьПараметр("ПроцентУточняемый", ЧИСЛО(PERCENT));
	Иначе
		Запрос.УстановитьПараметр("ПроцентУточняемый", "");
	КонецЕсли;
	//Костенюк Александр-Финиш 02.04.2012
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДКарты.Ссылка
	               |ИЗ
	               |	(ВЫБРАТЬ ПЕРВЫЕ 1
	               |		РегистрационныеКарты.Ссылка КАК Ссылка,
	               |		РегистрационныеКарты.ВладелецКарты КАК ВладелецКарты,
	               |		РегистрационныеКарты.ПроцентУточняемый КАК ПроцентУточняемый
	               |	ИЗ
	               |		Справочник.РегистрационныеКарты КАК РегистрационныеКарты
	               |	ГДЕ
	               |		РегистрационныеКарты.КодКарты = &КодКарты) КАК ДКарты";
	
	Результат =  Запрос.Выполнить();	  
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);	  
	
	Если Выборка.Следующий() Тогда 	  	  
		Если Выборка.Проверка Тогда
			НовыйСправочник = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Возврат;
		КонецЕсли;	  
	Иначе 
		СтрАнализа.Новых  =  СтрАнализа.Новых + 1;
		НовыйСправочник = Справочники.РегистрационныеКарты.СоздатьЭлемент();
		НовыйСправочник.УстановитьНовыйКод();
	КонецЕсли;
	
	Если ПустаяСтрока(НовыйСправочник.Код) Тогда 
		НовыйСправочник.УстановитьНовыйКод();  
	КонецЕсли;
	
	НовыйСправочник.Наименование = "№"+ CODE;
	НовыйСправочник.ВидКарты  = ВидКарты;
	НовыйСправочник.КодКарты  = CODE;
	НовыйСправочник.ВладелецКарты = NAME;
	//НовыйСправочник.ПроцентУточняемый = Число(PERCENT);
	//Костенюк Александр-Старт 02.04.2012
	Если ЗначениеЗаполнено(PERCENT) Тогда
		НовыйСправочник.ПроцентУточняемый = Число(PERCENT);
	КонецЕсли;
	//Костенюк Александр-Финиш 02.04.2012
	
	Попытка 
		НовыйСправочник.ОбменДанными.Загрузка =Истина;
		НовыйСправочник.Записать();  
	Исключение  
		
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиЭлементВСправочнике(CODE) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодКарты", CODE);	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РегистрационныеКарты.Ссылка
	               |ИЗ
	               |	Справочник.РегистрационныеКарты КАК РегистрационныеКарты
	               |ГДЕ
	               |	РегистрационныеКарты.КодКарты = &КодКарты";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.РегистрационныеКарты.ПустаяСсылка();
	Иначе 
		Возврат Результат.Выгрузить()[0].Ссылка;
	КонецЕсли;	 	
	
КонецФункции

//Костенюк Александр-Старт 05.07.2012
// Процедура производит заполнение реквизитов справочника
// 
// Параметры
// СправочникОбъект - Тип: СправочникОбъект.РегистрационныеКарты
// СтруктураРеквизитов - Тип: Структура, значения реквизитов, которые подлежат заполнению
// 
Процедура ЗаполнитьРеквизитыЭлементаСправочника(СправочникОбъект, СтруктураРеквизитов) Экспорт
	
	//СправочникОбъект.Наименование 		= "№ "+ СтруктураРеквизитов.КодКарты;
	ЗаполнитьЗначенияСвойств(СправочникОбъект, СтруктураРеквизитов);
	
КонецПроцедуры
//Костенюк Александр-Финиш 05.07.2012

//Костенюк Александр-Старт 17.06.2014
// 
// Процедура создает регистрационную карту
//
// Параметры:
// КодКарты - Тип: Строка. Код регистрационной карты.
//
Процедура СоздатьКарту(КодКарты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СправочникОбъект 			= Справочники.РегистрационныеКарты.СоздатьЭлемент();
	СправочникОбъект.КодКарты 	= КодКарты;
	СправочникОбъект.ВидКарты 	= Перечисления.ВидыИнформационныхКарт.Магнитная;
	
	Попытка
		СправочникОбъект.Записать();
		ТекстПредупреждения = НСтр("ru='Создана новая регистрационная карта '; uk='Створена нова реєстраційна карта '"); 
		FrontOffice.ВывестиПредупреждение(ТекстПредупреждения + СправочникОбъект.Наименование, , "Внимание");
	Исключение
		FrontOffice.ВывестиОшибку(ОписаниеОшибки());
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//Костенюк Александр-Финиш 17.06.2014
